In [1]:
import numpy as np
import pandas as pd

Q.1

In [2]:
data=pd.read_csv(r"E:\DIAT 2nd sem\assginments\data science tools and techniques\housingdata.csv.csv")

In [3]:
data.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

Q.2

In [4]:
data.columns

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [5]:
list(data.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8]

Q.3

In [6]:
data['STATE'].describe()    # total number of states are 9 and number of unique state is 6

count      9
unique     6
top       TN
freq       3
Name: STATE, dtype: object

In [7]:
print(data['STATE'].unique())  # unique states

['MP' 'MAHARASHTRA' 'AP' 'TN' 'ASSAM' 'HP']

Q.4

In [8]:
data.isna()

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

Q.5

In [9]:
data['NUM_BEDROOMS']=pd.to_numeric(data['NUM_BEDROOMS'],errors='coerce')

In [10]:
data.dropna(subset=['NUM_BEDROOMS'],inplace=True)

In [11]:
data

           PID        STATE      PRICE  NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654           3.0        1  1000
1  100002000.0  MAHARASHTRA      21325           3.0      1.5    --
3  100004000.0           TN     321321           1.0      NaN   700
4          NaN           TN  589465645           3.0        2  1600
6  100007000.0        ASSAM    3222321           2.0   HURLEY   950
7  100008000.0           HP      23131           1.0        1   NaN

Q.6.

In [12]:
data['NUM_BATH']=pd.to_numeric(data['NUM_BATH'],errors='coerce')

In [13]:
data

           PID        STATE      PRICE  NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654           3.0       1.0  1000
1  100002000.0  MAHARASHTRA      21325           3.0       1.5    --
3  100004000.0           TN     321321           1.0       NaN   700
4          NaN           TN  589465645           3.0       2.0  1600
6  100007000.0        ASSAM    3222321           2.0       NaN   950
7  100008000.0           HP      23131           1.0       1.0   NaN

In [14]:
data.fillna(method='ffill')

           PID        STATE      PRICE  NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654           3.0       1.0  1000
1  100002000.0  MAHARASHTRA      21325           3.0       1.5    --
3  100004000.0           TN     321321           1.0       1.5   700
4  100004000.0           TN  589465645           3.0       2.0  1600
6  100007000.0        ASSAM    3222321           2.0       2.0   950
7  100008000.0           HP      23131           1.0       1.0   950

Q.7.

In [15]:
data['SQ_FT']=pd.to_numeric(data['SQ_FT'],errors='coerce')

In [16]:
data

           PID        STATE      PRICE  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654           3.0       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325           3.0       1.5     NaN
3  100004000.0           TN     321321           1.0       NaN   700.0
4          NaN           TN  589465645           3.0       2.0  1600.0
6  100007000.0        ASSAM    3222321           2.0       NaN   950.0
7  100008000.0           HP      23131           1.0       1.0     NaN

In [17]:
mean_value=data['SQ_FT'].mean()

In [18]:
data['SQ_FT'].fillna(mean_value,inplace=True)

In [19]:
data

           PID        STATE      PRICE  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654           3.0       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325           3.0       1.5  1062.5
3  100004000.0           TN     321321           1.0       NaN   700.0
4          NaN           TN  589465645           3.0       2.0  1600.0
6  100007000.0        ASSAM    3222321           2.0       NaN   950.0
7  100008000.0           HP      23131           1.0       1.0  1062.5

Q.8.

In [20]:
print(sum(data['SQ_FT']))

6375.0

Q.9.

In [21]:
data['NUM_STORE']=np.ones(len(data.index))

In [22]:
data

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3.0,1.0,1000.0,1.0
1,100002000.0,MAHARASHTRA,21325,3.0,1.5,1062.5,1.0
3,100004000.0,TN,321321,1.0,NaN,700.0,1.0
4,NaN,TN,589465645,3.0,2.0,1600.0,1.0
6,100007000.0,ASSAM,3222321,2.0,NaN,950.0,1.0
7,100008000.0,HP,23131,1.0,1.0,1062.5,1.0

Q.10.

In [23]:
new_data=data.loc[data['STATE']=='TN']

In [24]:
new_data

           PID STATE      PRICE  NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321           1.0       NaN   700.0        1.0
4          NaN    TN  589465645           3.0       2.0  1600.0        1.0

Q.11.

In [25]:
sq_filter_data=data.loc[data['SQ_FT']>1000]

In [26]:
sq_filter_data

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3.0,1.5,1062.5,1.0
4,NaN,TN,589465645,3.0,2.0,1600.0,1.0
7,100008000.0,HP,23131,1.0,1.0,1062.5,1.0